app/controllers/pages_controller.rb

  def register_user
    username=params[:username]
    password=params[:password]

    user=User.new
    user.name=username
    user.password=password
    user.save
---
INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "4932975763"], ["password", "9999"], ["created_at", "2018-12-23 07:33:25.301024"], ["updated_at", "2018-12-23 07:33:25.301024"]]

  def login_check
    username=params[:username]
    password=params[:password]

    user=User.where("name=? and password=?",
     username, password)
---
SELECT "users".* FROM "users" WHERE (name='uchuyakyumuchu@gmail.com' and password='1111')